xuewanying/STM32_Learning/[小小飞控]模块组装/Remotemini/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "spi.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "nrf24l01.h"
#include "tran.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
uint8_t send_result = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define BEEP_ON()   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET)
#define BEEP_OFF()  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_RESET)
#define BEEP_TOGGLE() HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_12)
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_SPI2_Init();
  /* USER CODE BEGIN 2 */

	if (NRF_Init() == 1) {
    Tran_Init();                // ???????
    // ????????????
    BEEP_ON(); HAL_Delay(100); BEEP_OFF();
} else {
    // ?????:?????????
    while (1) {
        BEEP_ON(); HAL_Delay(100); BEEP_OFF(); HAL_Delay(100);
    }
}
HAL_Delay(1000);
//	Tran_SendThrottle();
//		uint8_t ret = Tran_SendThrottle();
//if (ret == 1) {

//    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);// ???????
//} else if (ret == 2) {
//    HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_12);
//		HAL_Delay(1000);
//} else {
//    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
//	HAL_Delay(1000);
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_RESET);
//		HAL_Delay(1000);
//	    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);}
  // ???nRF24L01??
//  if(NRF_Init() == 1) {
//		      BEEP_ON();
//          HAL_Delay(200);
//          BEEP_OFF();
//  } else {

//		      BEEP_ON();
//          HAL_Delay(200);
//          BEEP_OFF();
//					HAL_Delay(200);
//				  BEEP_ON();
//          HAL_Delay(200);
//          BEEP_OFF();
//      }
//			
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

    uint8_t ret = Tran_SendThrottle();
    static uint32_t last_beep = 0;
    static uint32_t success_cnt = 0;

    if (ret == 1) {
        success_cnt++;
        if (success_cnt >= 10) {  // ?10???(?10?)????
            BEEP_ON(); HAL_Delay(100); BEEP_OFF();
            success_cnt = 0;
        }
    } else {
        // ?????????
        BEEP_ON(); HAL_Delay(30); BEEP_OFF(); HAL_Delay(30);
        BEEP_ON(); HAL_Delay(30); BEEP_OFF();
//        BEEP_ON(); HAL_Delay(500); BEEP_OFF(); HAL_Delay(500);
//        BEEP_ON(); HAL_Delay(500); BEEP_OFF();
    }
    HAL_Delay(1000);
		
/*		uint8_t send_result = Tran_SendThrottle();  // ??Tran_SendThrottle????NRF_SendData

      if(send_result == 1) {          // ????
          BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();
      } else if(send_result == 2) {
          BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();
				  HAL_Delay(500);
				  BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();
      } else {                          
          BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();
				  HAL_Delay(500);
				  BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();
				  HAL_Delay(500);
				  BEEP_ON();
          HAL_Delay(500);
          BEEP_OFF();				
			
      }
	*/
      // ??????,????(??????,?20Hz -> 50ms)

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
